# IFCAnyHandle Operators

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCAnyHandle Operators
IFCAnyHandle Class See Also
---
The IFCAnyHandle type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two IFCAnyHandles are the same. |
| Inequality | Determines whether two IFCAnyHandles are different. |

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace